FemDesign.Reinforcement.BarReinforcement.#ctor
Parameterless constructor for serialization

FemDesign.Reinforcement.BarReinforcement.#ctor(System.Guid,FemDesign.Reinforcement.Wire,FemDesign.Reinforcement.Stirrups)
Construct stirrup bar reinforcement

FemDesign.Reinforcement.BarReinforcement.#ctor(FemDesign.Bars.Bar,FemDesign.Reinforcement.Wire,FemDesign.Reinforcement.Stirrups)
Construct stirrup bar reinforcement

FemDesign.Reinforcement.BarReinforcement.#ctor(System.Guid,FemDesign.Reinforcement.Wire,FemDesign.Reinforcement.LongitudinalBar)
Construct longitudinal bar reinforcement

FemDesign.Reinforcement.BarReinforcement.#ctor(FemDesign.Bars.Bar,FemDesign.Reinforcement.Wire,FemDesign.Reinforcement.LongitudinalBar)
Construct longitudinal bar reinforcement

FemDesign.Reinforcement.BarReinforcement.AddReinforcementToBar(FemDesign.Bars.Bar,System.Collections.Generic.List{FemDesign.Reinforcement.BarReinforcement},System.Boolean)
Add reinforcement to bar.
Internal method use by GH components and Dynamo nodes.
bar:
rebar:
overwrite: Overwrite rebar on bar if a rebar sharing guid already exists on the bar?